*** serverust-cli/src/queue.rs:71:5: replace truncate -> String with "xyzzy".into()

*** mutation diff:
--- serverust-cli/src/queue.rs
+++ replace truncate -> String with "xyzzy".into()
@@ -63,14 +63,10 @@
     out
 }
 
 fn row(label: &str, value: &str) -> String {
     format!("  {:<22} {value}\n", label)
 }
 
 fn truncate(s: &str, max: usize) -> String {
-    if s.len() <= max {
-        s.to_string()
-    } else {
-        format!("{}…", &s[..max])
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
