*** serverust-cli/src/scaffold.rs:138:5: replace generate_shared -> Result<()> with Ok(())

*** mutation diff:
--- serverust-cli/src/scaffold.rs
+++ replace generate_shared -> Result<()> with Ok(())
@@ -130,16 +130,14 @@
     body: String,
 ) -> Result<()> {
     let dir = base.join("src/modules").join(name);
     fs::create_dir_all(&dir).with_context(|| format!("creating {}", dir.display()))?;
     write_file(&dir.join(filename), &body)
 }
 
 fn generate_shared(base: &Path, kind_dir: &str, filename: String, body: String) -> Result<()> {
-    let dir = base.join("src/shared").join(kind_dir);
-    fs::create_dir_all(&dir).with_context(|| format!("creating {}", dir.display()))?;
-    write_file(&dir.join(filename), &body)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn write_file(path: &PathBuf, body: &str) -> Result<()> {
     fs::write(path, body).with_context(|| format!("writing {}", path.display()))
 }

*** result: Success
