*** serverust-cli/src/templates.rs:100:5: replace project_modules_mod_rs -> String with String::new()

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace project_modules_mod_rs -> String with String::new()
@@ -92,17 +92,17 @@
         .await?;
     Ok(())
 }
 "#
     .to_string()
 }
 
 pub fn project_modules_mod_rs() -> String {
-    "// declare seus módulos aqui: `pub mod users;`\n".to_string()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn project_shared_mod_rs() -> String {
     "// componentes compartilhados: guards, pipes, interceptors, filters\n".to_string()
 }
 
 pub fn controller(name: &str) -> String {
     let type_name = pascal_case(name);

*** result: Success
