*** serverust-cli/src/templates.rs:104:5: replace project_shared_mod_rs -> String with String::new()

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace project_shared_mod_rs -> String with String::new()
@@ -96,17 +96,17 @@
     .to_string()
 }
 
 pub fn project_modules_mod_rs() -> String {
     "// declare seus módulos aqui: `pub mod users;`\n".to_string()
 }
 
 pub fn project_shared_mod_rs() -> String {
-    "// componentes compartilhados: guards, pipes, interceptors, filters\n".to_string()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn controller(name: &str) -> String {
     let type_name = pascal_case(name);
     template_with_name_type(
         r#"use serverust_core::extract::Path;
 use serverust_macros::get;

*** result: Success
