*** serverust-cli/src/templates.rs:108:5: replace controller -> String with "xyzzy".into()

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace controller -> String with "xyzzy".into()
@@ -100,29 +100,17 @@
     "// declare seus módulos aqui: `pub mod users;`\n".to_string()
 }
 
 pub fn project_shared_mod_rs() -> String {
     "// componentes compartilhados: guards, pipes, interceptors, filters\n".to_string()
 }
 
 pub fn controller(name: &str) -> String {
-    let type_name = pascal_case(name);
-    template_with_name_type(
-        r#"use serverust_core::extract::Path;
-use serverust_macros::get;
-
-#[get("/{{NAME}}/{id}")]
-pub async fn show_{{NAME}}(Path(id): Path<u64>) -> String {
-    format!("{{TYPE}}::show id={id}")
-}
-"#,
-        name,
-        &type_name,
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn service(name: &str) -> String {
     let type_name = pascal_case(name);
     template_with_name_type(
         r#"use serverust_macros::injectable;
 
 #[injectable]

*** result: Success
