*** serverust-cli/src/templates.rs:11:5: replace project_cargo_toml -> String with String::new()

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace project_cargo_toml -> String with String::new()
@@ -3,32 +3,17 @@
 //! Cada função devolve uma `String` pronta para ser escrita em disco. Os
 //! templates são intencionalmente simples (sem engine externo) para manter o
 //! binário enxuto e fácil de manter — substituições são feitas via `replace`.
 
 const NAME_PLACEHOLDER: &str = "{{NAME}}";
 const TYPE_PLACEHOLDER: &str = "{{TYPE}}";
 
 pub fn project_cargo_toml(name: &str) -> String {
-    format!(
-        r#"[package]
-name = "{name}"
-version = "0.1.0"
-edition = "2024"
-rust-version = "1.85"
-
-[dependencies]
-serverust-core   = "0.1"
-serverust-lambda = "0.1"
-serverust-macros = "0.1"
-tokio  = {{ version = "1", features = ["macros", "rt-multi-thread"] }}
-serde  = {{ version = "1", features = ["derive"] }}
-utoipa = {{ version = "5", features = ["macros"] }}
-"#
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn project_serverust_toml(name: &str) -> String {
     format!(
         r#"# serverust.toml — configuração do projeto "{name}"
 # Perfis: default, dev, staging, prod
 # Selecione com SERVERUST_PROFILE=prod ou ServerustConfig::load_for_profile("prod")
 # Override por env: SERVERUST_SERVER__PORT=8080

*** result: Success
