*** serverust-cli/src/templates.rs:149:5: replace dto -> String with "xyzzy".into()

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace dto -> String with "xyzzy".into()
@@ -141,30 +141,17 @@
 }
 "#,
         name,
         &type_name,
     )
 }
 
 pub fn dto(name: &str) -> String {
-    let type_name = pascal_case(name);
-    template_with_name_type(
-        r#"use serde::{Deserialize, Serialize};
-use validator::Validate;
-
-#[derive(Debug, Deserialize, Serialize, Validate)]
-pub struct Create{{TYPE}}Dto {
-    #[validate(length(min = 1))]
-    pub name: String,
-}
-"#,
-        name,
-        &type_name,
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn module_mod_rs(name: &str, with_tests: bool) -> String {
     let mut out = format!(
         "#[path = \"{name}.controller.rs\"]\npub mod controller;\n\
          #[path = \"{name}.service.rs\"]\npub mod service;\n"
     );
     if with_tests {

*** result: Success
