*** serverust-cli/src/templates.rs:220:5: replace guard -> String with String::new()

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace guard -> String with String::new()
@@ -212,33 +212,17 @@
 }
 "#,
         name,
         &type_name,
     )
 }
 
 pub fn guard(name: &str) -> String {
-    let type_name = pascal_case(name);
-    template_with_name_type(
-        r#"use axum::http::request::Parts;
-use axum::response::Response;
-use serverust_core::pipeline::Guard;
-
-pub struct {{TYPE}}Guard;
-
-impl Guard for {{TYPE}}Guard {
-    async fn check(_parts: &Parts) -> Result<(), Response> {
-        Ok(())
-    }
-}
-"#,
-        name,
-        &type_name,
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn interceptor(name: &str) -> String {
     let type_name = pascal_case(name);
     template_with_name_type(
         r#"use axum::extract::Request;
 use axum::middleware::Next;
 use axum::response::Response;

*** result: Success
