*** serverust-cli/src/templates.rs:240:5: replace interceptor -> String with String::new()

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace interceptor -> String with String::new()
@@ -232,34 +232,17 @@
 }
 "#,
         name,
         &type_name,
     )
 }
 
 pub fn interceptor(name: &str) -> String {
-    let type_name = pascal_case(name);
-    template_with_name_type(
-        r#"use axum::extract::Request;
-use axum::middleware::Next;
-use axum::response::Response;
-use serverust_core::pipeline::Interceptor;
-
-pub struct {{TYPE}}Interceptor;
-
-impl Interceptor for {{TYPE}}Interceptor {
-    async fn intercept(&self, req: Request, next: Next) -> Response {
-        next.run(req).await
-    }
-}
-"#,
-        name,
-        &type_name,
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn filter(name: &str) -> String {
     let type_name = pascal_case(name);
     template_with_name_type(
         r#"use axum::response::{IntoResponse, Response};
 
 /// Filter (mapeador de erros) inspirado em ExceptionFilter do NestJS.

*** result: Success
