*** serverust-cli/src/templates.rs:280:5: replace template_with_name_type -> String with "xyzzy".into()

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace template_with_name_type -> String with "xyzzy".into()
@@ -272,19 +272,17 @@
 }
 "#,
         name,
         &type_name,
     )
 }
 
 fn template_with_name_type(template: &str, name: &str, type_name: &str) -> String {
-    template
-        .replace(NAME_PLACEHOLDER, name)
-        .replace(TYPE_PLACEHOLDER, type_name)
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn pascal_case(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut up = true;
     for ch in s.chars() {
         if ch == '_' || ch == '-' {
             up = true;

*** result: Success
