*** serverust-core/src/app.rs:141:9: replace App::interceptor -> Self with Default::default()

*** mutation diff:
--- serverust-core/src/app.rs
+++ replace App::interceptor -> Self with Default::default()
@@ -133,27 +133,17 @@
 
     /// Registra um interceptor (tower middleware) sobre as rotas do usuário.
     ///
     /// Aplicado em [`Self::into_router`] apenas às rotas registradas via
     /// [`Self::route`] — as rotas de documentação (`/openapi.json`, `/docs`,
     /// `/redoc`) ficam de fora intencionalmente, para que não dependam da
     /// pipeline de negócio (ex.: autenticação, rate limiting).
     pub fn interceptor<I: Interceptor>(mut self, interceptor: I) -> Self {
-        let interceptor = std::sync::Arc::new(interceptor);
-        let mutator: RouterMutator = Box::new(move |router: Router<Container>| {
-            let interceptor = interceptor.clone();
-            let layer = axum::middleware::from_fn(move |req: Request, next: Next| {
-                let interceptor = interceptor.clone();
-                async move { interceptor.intercept(req, next).await }
-            });
-            router.layer(layer)
-        });
-        self.interceptors.push(mutator);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Injeta uma [`ServerustConfig`] tipada no container. Handlers podem extraí-la via
     /// `State<Arc<ServerustConfig>>`.
     pub fn config(self, cfg: ServerustConfig) -> Self {
         self.provide::<ServerustConfig>(Arc::new(cfg))
     }

*** result: Success
