*** serverust-core/src/app.rs:194:9: delete ! in App::has_event_handlers

*** mutation diff:
--- serverust-core/src/app.rs
+++ delete ! in App::has_event_handlers
@@ -186,17 +186,17 @@
             .downcast_mut::<EventHandlerRegistry<E>>()
             .expect("type invariant: key matches registry type")
             .register(handler);
         self
     }
 
     /// Retorna `true` se pelo menos um event handler foi registrado (qualquer tipo `E`).
     pub fn has_event_handlers(&self) -> bool {
-        !self.event_registries.is_empty()
+         /* ~ changed by cargo-mutants ~ */self.event_registries.is_empty()
     }
 
     /// Constrói um [`EventDispatcher<E>`] com todos os handlers registrados
     /// para o tipo `E` e uma cópia do [`Container`] compartilhado.
     pub fn into_event_dispatcher<E: Send + 'static>(mut self) -> EventDispatcher<E> {
         let key = TypeId::of::<EventHandlerRegistry<E>>();
         let registry = self
             .event_registries

*** result: Success
