*** serverust-core/src/openapi.rs:40:9: replace OpenApiState::push_operation with ()

*** mutation diff:
--- serverust-core/src/openapi.rs
+++ replace OpenApiState::push_operation with ()
@@ -32,17 +32,17 @@
     }
 
     pub(crate) fn push_operation(
         &mut self,
         path: impl Into<String>,
         method: HttpMethod,
         op: Operation,
     ) {
-        self.paths.push((path.into(), method, op));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn register_schema<T: ToSchema + PartialSchema>(&mut self) {
         let name = T::name().into_owned();
         let schema = <T as PartialSchema>::schema();
         self.schemas.insert(name, schema);
     }

*** result: Success
