*** serverust-core/src/validation.rs:70:9: replace <impl IntoResponse for Json<T>>::into_response -> Response with Default::default()

*** mutation diff:
--- serverust-core/src/validation.rs
+++ replace <impl IntoResponse for Json<T>>::into_response -> Response with Default::default()
@@ -62,11 +62,11 @@
             Ok(()) => Ok(Json(value)),
             Err(errors) => Err(validation_error_response(&errors)),
         }
     }
 }
 
 impl<T: serde::Serialize> IntoResponse for Json<T> {
     fn into_response(self) -> Response {
-        axum::Json(self.0).into_response()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
