*** serverust-cli/src/commands.rs:153:5: replace tool_available -> bool with false

*** mutation diff:
--- serverust-cli/src/commands.rs
+++ replace tool_available -> bool with false
@@ -145,14 +145,10 @@
     } else {
         "⚠ RUST_LOG não configurado (default: info)".to_string()
     });
 
     lines.join("\n")
 }
 
 fn tool_available(bin: &str) -> bool {
-    Command::new(bin)
-        .arg("--version")
-        .output()
-        .map(|o| o.status.success())
-        .unwrap_or(false)
+    false /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
