*** serverust-cli/src/commands.rs:83:5: replace info_text -> String with "xyzzy".into()

*** mutation diff:
--- serverust-cli/src/commands.rs
+++ replace info_text -> String with "xyzzy".into()
@@ -75,23 +75,17 @@
     cmd
 }
 
 /// Texto exibido pelo subcomando `info`.
 ///
 /// As features listadas são as do framework serverust-telemetry disponíveis
 /// para projetos gerados (não as do próprio binário CLI).
 pub fn info_text() -> String {
-    let framework_features = ["otel (opt-in)", "dynamodb (opt-in)"];
-    format!(
-        "serverust-cli {version}\narch: {arch}\nframework features: {features}",
-        version = env!("CARGO_PKG_VERSION"),
-        arch = std::env::consts::ARCH,
-        features = framework_features.join(", "),
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Diagnóstico rápido do ambiente local para desenvolvimento serverust.
 pub fn doctor_report(base: &Path) -> String {
     let mut lines = Vec::new();
     let cfg = base.join("serverust.toml");
     let cargo = base.join("Cargo.toml");

*** result: Success
