*** serverust-cli/src/commands.rs:94:5: replace doctor_report -> String with "xyzzy".into()

*** mutation diff:
--- serverust-cli/src/commands.rs
+++ replace doctor_report -> String with "xyzzy".into()
@@ -86,72 +86,17 @@
         version = env!("CARGO_PKG_VERSION"),
         arch = std::env::consts::ARCH,
         features = framework_features.join(", "),
     )
 }
 
 /// Diagnóstico rápido do ambiente local para desenvolvimento serverust.
 pub fn doctor_report(base: &Path) -> String {
-    let mut lines = Vec::new();
-    let cfg = base.join("serverust.toml");
-    let cargo = base.join("Cargo.toml");
-
-    lines.push("serverust doctor".to_string());
-    lines.push(format!(
-        "cwd: {}",
-        base.to_str().unwrap_or("<invalid utf8 path>")
-    ));
-
-    if cargo.exists() {
-        lines.push("✓ Cargo.toml encontrado".to_string());
-    } else {
-        lines.push("✗ Cargo.toml ausente".to_string());
-    }
-
-    if cfg.exists() {
-        lines.push("✓ serverust.toml encontrado".to_string());
-        match std::fs::read_to_string(&cfg) {
-            Ok(text) => {
-                for section in [
-                    "[default.telemetry]",
-                    "[default.openapi]",
-                    "[default.server]",
-                ] {
-                    if text.contains(section) {
-                        lines.push(format!("✓ seção {section}"));
-                    } else {
-                        lines.push(format!("✗ seção {section} ausente"));
-                    }
-                }
-            }
-            Err(_) => lines.push("✗ falha ao ler serverust.toml".to_string()),
-        }
-    } else {
-        lines.push("✗ serverust.toml ausente".to_string());
-    }
-
-    lines.push(if tool_available("cargo-watch") {
-        "✓ cargo-watch instalado".to_string()
-    } else {
-        "✗ cargo-watch ausente (instale: cargo install cargo-watch)".to_string()
-    });
-    lines.push(if tool_available("cargo-lambda") {
-        "✓ cargo-lambda instalado".to_string()
-    } else {
-        "✗ cargo-lambda ausente (instale: cargo install cargo-lambda)".to_string()
-    });
-
-    lines.push(if std::env::var("RUST_LOG").is_ok() {
-        "✓ RUST_LOG configurado".to_string()
-    } else {
-        "⚠ RUST_LOG não configurado (default: info)".to_string()
-    });
-
-    lines.join("\n")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn tool_available(bin: &str) -> bool {
     Command::new(bin)
         .arg("--version")
         .output()
         .map(|o| o.status.success())
         .unwrap_or(false)

*** result: Success
