*** serverust-cli/src/lib.rs:140:5: replace spawn_status -> Result<()> with Ok(())

*** mutation diff:
--- serverust-cli/src/lib.rs
+++ replace spawn_status -> Result<()> with Ok(())
@@ -132,16 +132,10 @@
     }
     anyhow::bail!(
         "`cargo {subcommand}` não está disponível (necessário para este comando).\n\
          Instale com:\n    {install_hint}"
     );
 }
 
 fn spawn_status(mut cmd: std::process::Command, label: &str) -> Result<()> {
-    let status = cmd
-        .status()
-        .map_err(|e| anyhow::anyhow!("failed to spawn {label}: {e}"))?;
-    if !status.success() {
-        anyhow::bail!("{label} failed with status {status}");
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
