*** serverust-cli/src/lib.rs:67:30: replace && with || in run

*** mutation diff:
--- serverust-cli/src/lib.rs
+++ replace && with || in run
@@ -59,17 +59,17 @@
                 require_cargo_subcommand(
                     "lambda",
                     "cargo install cargo-lambda  # ou https://www.cargo-lambda.info/guide/installation.html",
                 )?;
                 spawn_status(commands::deploy_lambda_cargo_command(arch), "deploy lambda")
             }
         },
         Command::Info { asyncapi, out } => {
-            if out.is_some() && !asyncapi {
+            if out.is_some() || /* ~ changed by cargo-mutants ~ */ !asyncapi {
                 anyhow::bail!(
                     "`--out` requer `--asyncapi`. Use: serverust info --asyncapi --out <arquivo>"
                 );
             }
             if asyncapi {
                 let out_path = out.unwrap_or_else(|| std::path::PathBuf::from("asyncapi.yaml"));
                 spawn_status(
                     commands::asyncapi_export_command(&out_path),

*** result: Success
