*** serverust-cli/src/queue.rs:45:5: replace format_messages -> String with "xyzzy".into()

*** mutation diff:
--- serverust-cli/src/queue.rs
+++ replace format_messages -> String with "xyzzy".into()
@@ -37,35 +37,17 @@
 
     out.push_str(&row("Messages available:", messages));
     out.push_str(&row("Oldest message age:", &age));
     out.push_str(&row("Redrive policy:", redrive));
     out
 }
 
 pub fn format_messages(msgs: &[MessageSummary]) -> String {
-    if msgs.is_empty() {
-        return format!("{DIM}0 messages received (queue empty or all invisible){RESET}\n");
-    }
-    let mut out = String::new();
-    for (i, msg) in msgs.iter().enumerate() {
-        let preview = truncate(&msg.body_preview, BODY_PREVIEW_LEN);
-        let ts = msg
-            .sent_timestamp
-            .as_deref()
-            .map(|t| format!(" {DIM}(sent: {t}){RESET}"))
-            .unwrap_or_default();
-        out.push_str(&format!(
-            "{BOLD}[{}]{RESET} {CYAN}{}{RESET}{ts}\n    {}\n",
-            i + 1,
-            msg.message_id,
-            preview
-        ));
-    }
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn row(label: &str, value: &str) -> String {
     format!("  {:<22} {value}\n", label)
 }
 
 fn truncate(s: &str, max: usize) -> String {
     if s.len() <= max {

*** result: Success
