*** serverust-cli/src/queue.rs:67:5: replace row -> String with String::new()

*** mutation diff:
--- serverust-cli/src/queue.rs
+++ replace row -> String with String::new()
@@ -59,17 +59,17 @@
             msg.message_id,
             preview
         ));
     }
     out
 }
 
 fn row(label: &str, value: &str) -> String {
-    format!("  {:<22} {value}\n", label)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn truncate(s: &str, max: usize) -> String {
     if s.len() <= max {
         s.to_string()
     } else {
         format!("{}…", &s[..max])
     }

*** result: Success
