*** serverust-cli/src/scaffold.rs:123:5: replace generate_resource -> Result<()> with Ok(())

*** mutation diff:
--- serverust-cli/src/scaffold.rs
+++ replace generate_resource -> Result<()> with Ok(())
@@ -115,17 +115,17 @@
             &dir.join(format!("{name}.tests.rs")),
             &templates::module_test(name),
         )?;
     }
     Ok(())
 }
 
 fn generate_resource(base: &Path, name: &str) -> Result<()> {
-    generate_module(base, name, true, false)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn generate_single_module_file(
     base: &Path,
     name: &str,
     filename: String,
     body: String,
 ) -> Result<()> {

*** result: Success
