*** serverust-cli/src/scaffold.rs:49:5: replace generate -> Result<()> with Ok(())

*** mutation diff:
--- serverust-cli/src/scaffold.rs
+++ replace generate -> Result<()> with Ok(())
@@ -41,56 +41,17 @@
         &templates::project_shared_mod_rs(),
     )?;
     Ok(())
 }
 
 /// Gera scaffolding para um artefato (`controller`, `service`, etc.) em
 /// `base/src/...`.
 pub fn generate(base: &Path, kind: GenerateKind, name: &str, crud: bool) -> Result<()> {
-    match kind {
-        GenerateKind::Resource => generate_resource(base, name),
-        GenerateKind::Module => generate_module(base, name, crud, crud),
-        GenerateKind::Controller => generate_single_module_file(
-            base,
-            name,
-            format!("{name}.controller.rs"),
-            templates::controller(name),
-        ),
-        GenerateKind::Service => generate_single_module_file(
-            base,
-            name,
-            format!("{name}.service.rs"),
-            templates::service(name),
-        ),
-        GenerateKind::Pipe => generate_shared(
-            base,
-            "pipes",
-            format!("{name}.pipe.rs"),
-            templates::pipe(name),
-        ),
-        GenerateKind::Guard => generate_shared(
-            base,
-            "guards",
-            format!("{name}.guard.rs"),
-            templates::guard(name),
-        ),
-        GenerateKind::Interceptor => generate_shared(
-            base,
-            "interceptors",
-            format!("{name}.interceptor.rs"),
-            templates::interceptor(name),
-        ),
-        GenerateKind::Filter => generate_shared(
-            base,
-            "filters",
-            format!("{name}.filter.rs"),
-            templates::filter(name),
-        ),
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn generate_module(base: &Path, name: &str, with_dto: bool, with_tests: bool) -> Result<()> {
     let dir = base.join("src/modules").join(name);
     fs::create_dir_all(&dir).with_context(|| format!("creating {}", dir.display()))?;
     write_file(
         &dir.join("mod.rs"),
         &if with_dto {

*** result: Success
