*** serverust-cli/src/templates.rs:124:5: replace service -> String with String::new()

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace service -> String with String::new()
@@ -116,38 +116,17 @@
 }
 "#,
         name,
         &type_name,
     )
 }
 
 pub fn service(name: &str) -> String {
-    let type_name = pascal_case(name);
-    template_with_name_type(
-        r#"use serverust_macros::injectable;
-
-#[injectable]
-pub struct {{TYPE}}Service;
-
-impl {{TYPE}}Service {
-    pub fn new() -> Self {
-        Self
-    }
-}
-
-impl Default for {{TYPE}}Service {
-    fn default() -> Self {
-        Self::new()
-    }
-}
-"#,
-        name,
-        &type_name,
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn dto(name: &str) -> String {
     let type_name = pascal_case(name);
     template_with_name_type(
         r#"use serde::{Deserialize, Serialize};
 use validator::Validate;

*** result: Success
