*** serverust-cli/src/templates.rs:286:5: replace pascal_case -> String with String::new()

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace pascal_case -> String with String::new()
@@ -278,24 +278,10 @@
 
 fn template_with_name_type(template: &str, name: &str, type_name: &str) -> String {
     template
         .replace(NAME_PLACEHOLDER, name)
         .replace(TYPE_PLACEHOLDER, type_name)
 }
 
 fn pascal_case(s: &str) -> String {
-    let mut out = String::with_capacity(s.len());
-    let mut up = true;
-    for ch in s.chars() {
-        if ch == '_' || ch == '-' {
-            up = true;
-            continue;
-        }
-        if up {
-            out.extend(ch.to_uppercase());
-            up = false;
-        } else {
-            out.push(ch);
-        }
-    }
-    out
+    String::new() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
