*** serverust-cli/src/templates.rs:289:22: replace || with && in pascal_case

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace || with && in pascal_case
@@ -281,17 +281,17 @@
         .replace(NAME_PLACEHOLDER, name)
         .replace(TYPE_PLACEHOLDER, type_name)
 }
 
 fn pascal_case(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut up = true;
     for ch in s.chars() {
-        if ch == '_' || ch == '-' {
+        if ch == '_' && /* ~ changed by cargo-mutants ~ */ ch == '-' {
             up = true;
             continue;
         }
         if up {
             out.extend(ch.to_uppercase());
             up = false;
         } else {
             out.push(ch);

*** result: Success
