*** serverust-cli/src/templates.rs:30:5: replace project_serverust_toml -> String with String::new()

*** mutation diff:
--- serverust-cli/src/templates.rs
+++ replace project_serverust_toml -> String with String::new()
@@ -22,48 +22,17 @@
 tokio  = {{ version = "1", features = ["macros", "rt-multi-thread"] }}
 serde  = {{ version = "1", features = ["derive"] }}
 utoipa = {{ version = "5", features = ["macros"] }}
 "#
     )
 }
 
 pub fn project_serverust_toml(name: &str) -> String {
-    format!(
-        r#"# serverust.toml — configuração do projeto "{name}"
-# Perfis: default, dev, staging, prod
-# Selecione com SERVERUST_PROFILE=prod ou ServerustConfig::load_for_profile("prod")
-# Override por env: SERVERUST_SERVER__PORT=8080
-
-[default.server]
-host = "127.0.0.1"
-port = 3000
-
-[default.lambda]
-memory_size = 128
-timeout_seconds = 30
-
-[default.telemetry]
-log_level = "info"
-format = "json"
-
-[default.openapi]
-title = "{name}"
-version = "0.1.0"
-docs_path = "/docs"
-redoc_path = "/redoc"
-
-[dev.server]
-port = 3001
-
-[prod.server]
-host = "0.0.0.0"
-port = 8080
-"#
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn project_main_rs() -> String {
     r#"use serde::Serialize;
 use serverust_core::{App, extract::Json};
 use serverust_lambda::AppRuntime;
 use serverust_macros::get;
 use utoipa::ToSchema;

*** result: Success
