*** serverust-core/src/app.rs:102:9: replace App::register_schema -> Self with Default::default()

*** mutation diff:
--- serverust-core/src/app.rs
+++ replace App::register_schema -> Self with Default::default()
@@ -94,18 +94,17 @@
     /// Customiza `title` e `version` do documento OpenAPI gerado.
     pub fn openapi_info(mut self, title: impl Into<String>, version: impl Into<String>) -> Self {
         self.openapi.set_info(title, version);
         self
     }
 
     /// Registra um schema `T: ToSchema` em `components.schemas` do OpenAPI.
     pub fn register_schema<T: ToSchema + PartialSchema>(mut self) -> Self {
-        self.openapi.register_schema::<T>();
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Customiza o path em que o Scalar API Reference é servido (default `/docs`).
     pub fn docs(mut self, path: &'static str) -> Self {
         self.docs_path = path;
         self
     }

*** result: Success
