*** serverust-core/src/app.rs:114:9: replace App::redoc -> Self with Default::default()

*** mutation diff:
--- serverust-core/src/app.rs
+++ replace App::redoc -> Self with Default::default()
@@ -106,18 +106,17 @@
     /// Customiza o path em que o Scalar API Reference é servido (default `/docs`).
     pub fn docs(mut self, path: &'static str) -> Self {
         self.docs_path = path;
         self
     }
 
     /// Customiza o path em que o ReDoc é servido (default `/redoc`).
     pub fn redoc(mut self, path: &'static str) -> Self {
-        self.redoc_path = path;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Registra um service com lifetime Singleton no container.
     ///
     /// `T` pode ser `dyn Trait`: `app.provide::<dyn MyService>(Arc::new(impl))`.
     /// Handlers extraem o serviço via `State<Arc<dyn MyService>>`.
     pub fn provide<T: ?Sized + Send + Sync + 'static>(mut self, value: Arc<T>) -> Self {
         self.container.insert(value);

*** result: Success
