*** serverust-core/src/app.rs:180:9: replace App::event -> Self with Default::default()

*** mutation diff:
--- serverust-core/src/app.rs
+++ replace App::event -> Self with Default::default()
@@ -172,26 +172,17 @@
     /// sequência por [`EventDispatcher::dispatch_event`]. O [`Container`] é
     /// compartilhado entre handlers HTTP e event handlers — os mesmos serviços
     /// registrados via [`Self::provide`] ficam disponíveis em `ctx`.
     pub fn event<E, H>(mut self, handler: H) -> Self
     where
         E: Send + 'static,
         H: EventHandler<E>,
     {
-        let key = TypeId::of::<EventHandlerRegistry<E>>();
-        let registry = self
-            .event_registries
-            .entry(key)
-            .or_insert_with(|| Box::new(EventHandlerRegistry::<E>::new()));
-        registry
-            .downcast_mut::<EventHandlerRegistry<E>>()
-            .expect("type invariant: key matches registry type")
-            .register(handler);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Retorna `true` se pelo menos um event handler foi registrado (qualquer tipo `E`).
     pub fn has_event_handlers(&self) -> bool {
         !self.event_registries.is_empty()
     }
 
     /// Constrói um [`EventDispatcher<E>`] com todos os handlers registrados

*** result: Success
