*** serverust-core/src/app.rs:96:9: replace App::openapi_info -> Self with Default::default()

*** mutation diff:
--- serverust-core/src/app.rs
+++ replace App::openapi_info -> Self with Default::default()
@@ -88,18 +88,17 @@
             redoc_path: "/redoc",
             interceptors: Vec::new(),
             event_registries: HashMap::new(),
         }
     }
 
     /// Customiza `title` e `version` do documento OpenAPI gerado.
     pub fn openapi_info(mut self, title: impl Into<String>, version: impl Into<String>) -> Self {
-        self.openapi.set_info(title, version);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Registra um schema `T: ToSchema` em `components.schemas` do OpenAPI.
     pub fn register_schema<T: ToSchema + PartialSchema>(mut self) -> Self {
         self.openapi.register_schema::<T>();
         self
     }

*** result: Success
