*** serverust-core/src/config.rs:128:9: replace ServerustConfig::load_for_profile -> Result<Self, figment::Error> with Ok(Default::default())

*** mutation diff:
--- serverust-core/src/config.rs
+++ replace ServerustConfig::load_for_profile -> Result<Self, figment::Error> with Ok(Default::default())
@@ -120,17 +120,17 @@
     pub fn load() -> Result<Self, figment::Error> {
         Self::load_for_profile(Profile::Default)
     }
 
     /// Carrega de `serverust.toml` com perfil específico.
     /// Perfil herda dados do `[default]` e os sobrescreve com `[<profile>]`.
     /// O perfil também pode ser definido via `SERVERUST_PROFILE`.
     pub fn load_for_profile(profile: impl Into<Profile>) -> Result<Self, figment::Error> {
-        Self::load_from_for_profile("serverust.toml", profile)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Carrega de arquivo específico no perfil `default`. Útil em testes.
     pub fn load_from(path: &str) -> Result<Self, figment::Error> {
         Self::load_from_for_profile(path, Profile::Default)
     }
 
     /// Carrega de arquivo específico com perfil específico. Útil em testes.

*** result: Success
