*** serverust-core/src/config.rs:133:9: replace ServerustConfig::load_from -> Result<Self, figment::Error> with Ok(Default::default())

*** mutation diff:
--- serverust-core/src/config.rs
+++ replace ServerustConfig::load_from -> Result<Self, figment::Error> with Ok(Default::default())
@@ -125,17 +125,17 @@
     /// Perfil herda dados do `[default]` e os sobrescreve com `[<profile>]`.
     /// O perfil também pode ser definido via `SERVERUST_PROFILE`.
     pub fn load_for_profile(profile: impl Into<Profile>) -> Result<Self, figment::Error> {
         Self::load_from_for_profile("serverust.toml", profile)
     }
 
     /// Carrega de arquivo específico no perfil `default`. Útil em testes.
     pub fn load_from(path: &str) -> Result<Self, figment::Error> {
-        Self::load_from_for_profile(path, Profile::Default)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Carrega de arquivo específico com perfil específico. Útil em testes.
     pub fn load_from_for_profile(
         path: &str,
         profile: impl Into<Profile>,
     ) -> Result<Self, figment::Error> {
         // .nested() faz top-level TOML keys virarem profile names:

*** result: Success
