*** serverust-core/src/config.rs:146:9: replace ServerustConfig::load_from_for_profile -> Result<Self, figment::Error> with Ok(Default::default())

*** mutation diff:
--- serverust-core/src/config.rs
+++ replace ServerustConfig::load_from_for_profile -> Result<Self, figment::Error> with Ok(Default::default())
@@ -138,16 +138,11 @@
         path: &str,
         profile: impl Into<Profile>,
     ) -> Result<Self, figment::Error> {
         // .nested() faz top-level TOML keys virarem profile names:
         // [default.server] → profile "default", key "server"
         // [dev.server]     → profile "dev", key "server"
         // Env::prefixed usa separador __ para campos aninhados:
         // SERVERUST_SERVER__PORT → server.port
-        Figment::new()
-            .merge(Serialized::defaults(Self::default()))
-            .merge(Toml::file(path).nested())
-            .merge(Env::prefixed("SERVERUST_").split("__"))
-            .select(profile)
-            .extract()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
