*** serverust-core/src/events/mod.rs:107:28: replace == with != in EventDispatcher<E>::dispatch_event

*** mutation diff:
--- serverust-core/src/events/mod.rs
+++ replace == with != in EventDispatcher<E>::dispatch_event
@@ -99,17 +99,17 @@
     /// Despacha `event` para todos os handlers registrados em sequência.
     /// Retorna no primeiro erro encontrado.
     pub async fn dispatch_event(&self, event: E) -> Result<(), EventError>
     where
         E: Clone,
     {
         let last = self.handlers.len().saturating_sub(1);
         for (i, handler) in self.handlers.iter().enumerate() {
-            let evt = if i == last {
+            let evt = if i != /* ~ changed by cargo-mutants ~ */ last {
                 // Último handler: consume sem clone extra (mas E: Clone já existe)
                 event.clone()
             } else {
                 event.clone()
             };
             handler.handle_erased(evt, &self.container).await?;
         }
         Ok(())

*** result: Success
