*** serverust-core/src/events/mod.rs:20:9: replace <impl std::fmt::Display for EventError>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- serverust-core/src/events/mod.rs
+++ replace <impl std::fmt::Display for EventError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -12,17 +12,17 @@
 use crate::container::Container;
 
 /// Erro retornado por [`EventHandler::handle`].
 #[derive(Debug)]
 pub struct EventError(pub String);
 
 impl std::fmt::Display for EventError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        write!(f, "EventError: {}", self.0)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for EventError {}
 
 /// Handler para um tipo de evento `E`.
 ///
 /// Implementadores recebem o evento por valor e o [`Container`] compartilhado

*** result: Success
