*** serverust-core/src/openapi.rs:30:9: replace OpenApiState::set_info with ()

*** mutation diff:
--- serverust-core/src/openapi.rs
+++ replace OpenApiState::set_info with ()
@@ -22,18 +22,17 @@
     version: Option<String>,
     /// Para preservar ordem de inserção e mergear múltiplos métodos no mesmo path.
     paths: Vec<(String, HttpMethod, Operation)>,
     schemas: BTreeMap<String, RefOr<Schema>>,
 }
 
 impl OpenApiState {
     pub(crate) fn set_info(&mut self, title: impl Into<String>, version: impl Into<String>) {
-        self.title = Some(title.into());
-        self.version = Some(version.into());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn push_operation(
         &mut self,
         path: impl Into<String>,
         method: HttpMethod,
         op: Operation,
     ) {

*** result: Success
