*** serverust-core/src/openapi.rs:50:9: replace OpenApiState::build -> OpenApi with Default::default()

*** mutation diff:
--- serverust-core/src/openapi.rs
+++ replace OpenApiState::build -> OpenApi with Default::default()
@@ -42,56 +42,17 @@
 
     pub(crate) fn register_schema<T: ToSchema + PartialSchema>(&mut self) {
         let name = T::name().into_owned();
         let schema = <T as PartialSchema>::schema();
         self.schemas.insert(name, schema);
     }
 
     pub(crate) fn build(&self) -> OpenApi {
-        let info = InfoBuilder::new()
-            .title(self.title.clone().unwrap_or_else(|| "serverust".into()))
-            .version(self.version.clone().unwrap_or_else(|| "0.1.0".into()))
-            .build();
-
-        // Agrupa operations por path (suporta múltiplos métodos no mesmo path).
-        let mut grouped: BTreeMap<String, Vec<(HttpMethod, Operation)>> = BTreeMap::new();
-        for (path, method, op) in &self.paths {
-            grouped
-                .entry(path.clone())
-                .or_default()
-                .push((method.clone(), op.clone()));
-        }
-
-        let mut paths_builder = PathsBuilder::new();
-        for (path, ops) in grouped {
-            let mut item_builder = PathItemBuilder::new();
-            for (method, op) in ops {
-                item_builder = item_builder.operation(method, op);
-            }
-            let item: PathItem = item_builder.build();
-            paths_builder = paths_builder.path(path, item);
-        }
-        let paths: Paths = paths_builder.build();
-
-        let components: Option<Components> = if self.schemas.is_empty() {
-            None
-        } else {
-            let mut cb = ComponentsBuilder::new();
-            for (name, schema) in &self.schemas {
-                cb = cb.schema(name, schema.clone());
-            }
-            Some(cb.build())
-        };
-
-        OpenApiBuilder::new()
-            .info(info)
-            .paths(paths)
-            .components(components)
-            .build()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// HTML embutido que carrega Scalar API Reference via CDN apontando para `spec_url`.
 pub(crate) fn swagger_ui_html(spec_url: &str) -> String {
     format!(
         r##"<!DOCTYPE html>
 <html lang="en">

*** result: Success
